{"backend": 0, "engineer": 1, "sql": 2, "spark": 3, "cloud": 4, "software": 5, "data": 6, "professional": 7, "years": 8, "experience": 9, "building": 10, "pipelines": 11, "systems": 12, "analytics": 13, "infrastructure": 14, "hybrid": 15, "airflow": 16, "warehouses": 17, "home": 18, "territory": 19, "competence": 20, "ml": 21, "side": 22, "my": 23, "toolkit": 24, "solid": 25, "engineering": 26, "python": 27, "warehouse": 28, "design": 29, "ve": 30, "completed": 31, "couple": 32, "self": 33, "directed": 34, "projects": 35, "kaggle": 36, "competitions": 37, "fine": 38, "tuning": 39, "small": 40, "models": 41, "interested": 42, "transitioning": 43, "toward": 44, "more": 45, "ai": 46, "focused": 47, "work": 48, "ideally": 49, "company": 50, "where": 51, "can": 52, "leverage": 53, "existing": 54, "infra": 55, "skills": 56, "while": 57, "learning": 58, "modern": 59, "practice": 60, "services": 61, "implemented": 62, "streaming": 63, "kafka": 64, "real": 65, "time": 66, "user": 67, "activity": 68, "processing": 69, "platform": 70, "designed": 71, "schema": 72, "registry": 73, "integration": 74, "watermark": 75, "state": 76, "management": 77, "approach": 78, "deduplication": 79, "logic": 80, "late": 81, "arriving": 82, "events": 83, "worked": 84, "closely": 85, "science": 86, "team": 87, "make": 88, "sure": 89, "feature": 90, "aligned": 91, "what": 92, "needed": 93, "most": 94, "career": 95, "has": 96, "been": 97, "some": 98, "adjacent": 99, "exposure": 100, "paper": 101, "products": 102, "built": 103, "maintained": 104, "apache": 105, "500gb": 106, "daily": 107, "transactional": 108, "across": 109, "12": 110, "source": 111, "extensively": 112, "pyspark": 113, "batch": 114, "dbt": 115, "transformation": 116, "modeling": 117, "layer": 118, "our": 119, "snowflake": 120, "owned": 121, "call": 122, "rotation": 123, "quality": 124, "issues": 125, "wrote": 126, "checks": 127, "detect": 128, "drift": 129, "unusual": 130, "volume": 131, "changes": 132, "pipeline": 133, "supports": 134, "few": 135, "internal": 136, "tailwind": 137, "nlp": 138, "image": 139, "classification": 140, "llms": 141, "weights": 142, "biases": 143, "speech": 144, "recognition": 145, "photoshop": 146, "tts": 147, "lora": 148, "beam": 149, "aws": 150, "flask": 151, "bentoml": 152, "milvus": 153, "gans": 154, "statistical": 155, "gcp": 156, "operations": 157, "manager": 158, "yrs": 159, "background": 160, "marketing": 161, "led": 162, "teams": 163, "kpis": 164, "driven": 165, "business": 166, "outcomes": 167, "domain": 168, "lately": 169, "curious": 170, "about": 171, "how": 172, "tools": 173, "could": 174, "augment": 175, "experimented": 176, "chatgpt": 177, "other": 178, "productivity": 179, "content": 180, "creation": 181, "think": 182, "space": 183, "exciting": 184, "open": 185, "roles": 186, "apply": 187, "expertise": 188, "alongside": 189, "emerging": 190, "capabilities": 191, "customer": 192, "support": 193, "lead": 194, "saas": 195, "product": 196, "managed": 197, "agents": 198, "handling": 199, "tier": 200, "tickets": 201, "escalation": 202, "process": 203, "feedback": 204, "loop": 205, "out": 206, "knowledge": 207, "base": 208, "agent": 209, "training": 210, "program": 211, "strong": 212, "people": 213, "lighter": 214, "technical": 215, "depth": 216, "beyond": 217, "mechanical": 218, "role": 219, "hardware": 220, "two": 221, "subsystems": 222, "through": 223, "full": 224, "lifecycle": 225, "concept": 226, "dfm": 227, "dfma": 228, "review": 229, "prototype": 230, "production": 231, "tooling": 232, "comfortable": 233, "cad": 234, "solidworks": 235, "creo": 236, "fea": 237, "ansys": 238, "typical": 239, "development": 240, "cadence": 241, "manufacturing": 242, "partners": 243, "scale": 244, "up": 245, "writing": 246, "seo": 247, "strategy": 248, "tech": 249, "publication": 250, "longform": 251, "articles": 252, "developer": 253, "platforms": 254, "topics": 255, "including": 256, "ranked": 257, "first": 258, "page": 259, "search": 260, "high": 261, "competition": 262, "keywords": 263, "freelance": 264, "writer": 265, "pool": 266, "editorial": 267, "calendar": 268, "recent": 269, "assisted": 270, "using": 271, "llm": 272, "research": 273, "drafting": 274, "editing": 275, "maintaining": 276, "brand": 277, "creative": 278, "direction": 279, "consumer": 280, "identity": 281, "logo": 282, "visual": 283, "system": 284, "typography": 285, "packaging": 286, "digital": 287, "web": 288, "social": 289, "rebrand": 290, "external": 291, "agency": 292, "adobe": 293, "suite": 294, "figma": 295, "project": 296, "react": 297, "typescript": 298, "javascript": 299, "spent": 300, "mostly": 301, "driving": 302, "relationships": 303, "analyst": 304, "consulting": 305, "firm": 306, "working": 307, "primarily": 308, "retail": 309, "cpg": 310, "clients": 311, "conducted": 312, "diagnostics": 313, "re": 314, "stakeholder": 315, "structured": 316, "problem": 317, "solving": 318, "slide": 319, "craft": 320, "excel": 321, "executive": 322, "communication": 323, "involved": 324, "advisory": 325, "own": 326, "limited": 327, "angular": 328, "accounting": 329, "kubernetes": 330, "databricks": 331, "logistics": 332, "fulfillment": 333, "managing": 334, "80": 335, "receiving": 336, "picking": 337, "packing": 338, "outbound": 339, "tracked": 340, "operational": 341, "accuracy": 342, "cost": 343, "per": 344, "order": 345, "continuous": 346, "improvement": 347, "initiatives": 348, "drove": 349, "22": 350, "gain": 351, "over": 352, "18": 353, "months": 354, "node": 355, "js": 356, "redux": 357, "graphql": 358, "object": 359, "detection": 360, "webpack": 361, "six": 362, "sigma": 363, "sap": 364, "accountant": 365, "helping": 366, "11": 367, "hr": 368, "senior": 369, "mid": 370, "sized": 371, "month": 372, "end": 373, "close": 374, "financial": 375, "reporting": 376, "statutory": 377, "compliance": 378, "gaap": 379, "ind": 380, "tax": 381, "filings": 382, "gl": 383, "fixed": 384, "asset": 385, "register": 386, "audit": 387, "readiness": 388, "function": 389, "staff": 390, "accountants": 391, "discipline": 392, "around": 393, "cycle": 394, "reducing": 395, "from": 396, "days": 397, "last": 398, "powerpoint": 399, "flink": 400, "conglomerate": 401, "sales": 402, "grpc": 403, "django": 404, "terraform": 405, "civil": 406, "mongodb": 407, "scrum": 408, "illustrator": 409, "leadership": 410, "b2b": 411, "demand": 412, "generation": 413, "paid": 414, "acquisition": 415, "email": 416, "nurture": 417, "performance": 418, "definitions": 419, "sdr": 420, "handoff": 421, "focus": 422, "account": 423, "based": 424, "enterprise": 425, "segment": 426, "java": 427, "bigquery": 428, "rust": 429, "html": 430, "solutions": 431, "market": 432, "carried": 433, "8m": 434, "arr": 435, "quota": 436, "consistently": 437, "delivered": 438, "against": 439, "three": 440, "prospecting": 441, "discovery": 442, "evaluation": 443, "se": 444, "commercial": 445, "negotiation": 446, "consultative": 447, "selling": 448, "buyers": 449, "engaging": 450, "both": 451, "finance": 452, "stakeholders": 453, "opencv": 454, "go": 455, "shipped": 456, "features": 457, "core": 458, "day": 459, "transportation": 460, "mixed": 461, "startup": 462, "maybe": 463, "30": 464, "lightweight": 465, "clustering": 466, "churn": 467, "prediction": 468, "sklearn": 469, "xgboost": 470, "70": 471, "dashboards": 472, "wouldn": 473, "myself": 474, "specialist": 475, "experimentation": 476, "framework": 477, "tests": 478, "spring": 479, "boot": 480, "kubeflow": 481, "elasticsearch": 482, "cnn": 483, "azure": 484, "prompt": 485, "mlops": 486, "bm25": 487, "qa": 488, "devops": 489, "fundamentals": 490, "conventional": 491, "apis": 492, "databases": 493, "queues": 494, "deployments": 495, "keeping": 496, "learner": 497, "level": 498, "taken": 499, "online": 500, "courses": 501, "played": 502, "openai": 503, "anthropic": 504, "rag": 505, "haven": 506, "done": 507, "capacity": 508, "yet": 509, "either": 510, "deepen": 511, "start": 512, "contributing": 513, "android": 514, "mobile": 515, "recently": 516, "kotlin": 517, "app": 518, "multiple": 519, "main": 520, "shopping": 521, "flow": 522, "push": 523, "notification": 524, "offline": 525, "sync": 526, "jetpack": 527, "components": 528, "patterns": 529, "mvvm": 530, "hilt": 531, "coroutines": 532, "entirely": 533, "so": 534, "far": 535, "expanding": 536, "broader": 537, "test": 538, "automation": 539, "fintech": 540, "selenium": 541, "pytest": 542, "plus": 543, "load": 544, "testing": 545, "setup": 546, "locust": 547, "developers": 548, "testability": 549, "acceptance": 550, "criteria": 551, "shifting": 552, "responsibility": 553, "dev": 554, "moving": 555, "gate": 556, "coach": 557, "recommendation": 558, "fastapi": 559, "hugging": 560, "face": 561, "transformers": 562, "postgresql": 563, "vue": 564, "agile": 565, "substantial": 566, "cross": 567, "functional": 568, "collaboration": 569, "execution": 570, "frontend": 571, "stack": 572, "comfort": 573, "zone": 574, "database": 575, "food": 576, "delivery": 577, "media": 578, "surrounding": 579, "jest": 580, "cypress": 581, "scratch": 582, "migration": 583, "legacy": 584, "angularjs": 585, "accessibility": 586, "animations": 587, "faiss": 588, "opensearch": 589, "yolo": 590, "rest": 591, "frontends": 592, "parts": 593, "architecture": 594, "vpc": 595, "iam": 596, "networking": 597, "modules": 598, "service": 599, "cluster": 600, "ci": 601, "cd": 602, "gitlab": 603, "argocd": 604, "monitoring": 605, "prometheus": 606, "grafana": 607, "loki": 608, "ops": 609, "much": 610, "application": 611, "large": 612, "microservices": 613, "inter": 614, "messaging": 615, "postgres": 616, "redis": 617, "storage": 618, "onboarding": 619, "which": 620, "orchestrating": 621, "downstream": 622, "ecosystem": 623, "transaction": 624, "looking": 625, "deeper": 626, "distributed": 627, "expand": 628, "stacks": 629, "pytorch": 630, "qdrant": 631, "computer": 632, "vision": 633, "next": 634, "tally": 635, "hadoop": 636, "graphic": 637, "designer": 638, "salesforce": 639, "crm": 640, "enthusiast": 641, "14": 642, "have": 643, "responsibilities": 644, "excited": 645, "genai": 646, "taking": 647, "vector": 648, "experimenting": 649, "langchain": 650, "api": 651, "exploring": 652, "streamline": 653, "workflows": 654, "current": 655, "combine": 656, "technologies": 657, "interesting": 658, "opportunities": 659, "intersection": 660, "positions": 661, "contribute": 662, "grow": 663, "etl": 664, "pinecone": 665, "embeddings": 666, "commerce": 667, "forecasting": 668, "docker": 669, "admin": 670, "interfaces": 671, "backing": 672, "them": 673, "endpoint": 674, "deployment": 675, "via": 676, "though": 677, "peft": 678, "information": 679, "retrieval": 680, "10": 681, "ranking": 682, "machine": 683, "powered": 684, "applied": 685, "migrated": 686, "keyword": 687, "embedding": 688, "learned": 689, "problems": 690, "actually": 691, "disguise": 692, "academic": 693, "cs": 694, "come": 695, "shipping": 696, "seeing": 697, "holds": 698, "under": 699, "ic": 700, "companies": 701, "meaningful": 702, "piece": 703, "trained": 704, "feed": 705, "lightgbm": 706, "families": 707, "metadata": 708, "behavior": 709, "signals": 710, "item": 711, "engagement": 712, "history": 713, "correlation": 714, "analysis": 715, "determined": 716, "metrics": 717, "predicted": 718, "pms": 719, "define": 720, "optimization": 721, "target": 722, "click": 723, "vs": 724, "dwell": 725, "conversion": 726, "important": 727, "itself": 728, "evolving": 729, "hand": 730, "tuned": 731, "scoring": 732, "rank": 733, "model": 734, "relevance": 735, "labeling": 736, "mix": 737, "explicit": 738, "human": 739, "judgments": 740, "eval": 741, "workflow": 742, "part": 743, "almost": 744, "easy": 745, "bit": 746, "final": 747, "improved": 748, "revenue": 749, "mlflow": 750, "sentence": 751, "scikit": 752, "learn": 753, "net": 754, "css": 755, "weaviate": 756, "13": 757, "haystack": 758, "tensorflow": 759, "reinforcement": 760, "deep": 761, "diffusion": 762, "asr": 763, "generative": 764, "explorer": 765, "started": 766, "gradually": 767, "moved": 768, "closer": 769, "now": 770, "basic": 771, "semantic": 772, "qlora": 773, "pgvector": 774, "series": 775, "scientist": 776, "predictive": 777, "extraction": 778, "strongest": 779, "pandas": 780, "standard": 781, "still": 782, "step": 783, "ownership": 784, "just": 785, "sentiment": 786, "document": 787, "dashboard": 788, "bag": 789, "words": 790, "transformer": 791, "classifiers": 792, "distilbert": 793, "harder": 794, "classes": 795, "datasets": 796, "pre": 797, "llamaindex": 798, "applications": 799, "edtech": 800, "growth": 801, "stage": 802, "proper": 803, "migrating": 804, "tangled": 805, "set": 806, "replicas": 807, "clean": 808, "orchestration": 809, "bi": 810, "looker": 811, "bulk": 812, "analytical": 813, "supporting": 814, "50": 815, "complex": 816, "heavy": 817, "window": 818, "functions": 819, "ctes": 820, "incremental": 821, "dimensional": 822, "slowly": 823, "changing": 824, "dimensions": 825, "well": 826, "query": 827, "sizing": 828, "materialized": 829, "views": 830, "also": 831, "lineage": 832, "documentation": 833, "use": 834, "org": 835, "moderation": 836, "resnet": 837, "variants": 838, "labeled": 839, "dataset": 840, "200k": 841, "images": 842, "loading": 843, "augmentation": 844, "inference": 845, "cv": 846, "contributed": 847, "fraud": 848, "integrating": 849, "store": 850, "serving": 851, "observability": 852, "scientists": 853, "secondary": 854, "serves": 855, "3k": 856, "paying": 857, "customers": 858, "includes": 859, "another": 860, "reliability": 861, "want": 862, "get": 863, "serious": 864, "surface": 865, "facing": 866, "likelihood": 867, "lifetime": 868, "value": 869, "estimation": 870, "used": 871, "were": 872, "gradient": 873, "boosted": 874, "trees": 875, "engineered": 876, "split": 877, "roughly": 878, "60": 879, "40": 880, "between": 881, "prep": 882, "retention": 883, "than": 884, "productionization": 885, "who": 886, "makes": 887, "possible": 888, "getting": 889, "right": 890, "do": 891, "style": 892, "weight": 893, "faang": 894, "combination": 895, "collaborative": 896, "filtering": 897, "matrix": 898, "factorization": 899, "implicit": 900, "library": 901, "pure": 902, "handled": 903, "supply": 904, "chain": 905, "prophet": 906, "one": 907, "lstm": 908, "ended": 909, "ran": 910, "experiments": 911, "dynamic": 912, "pricing": 913, "those": 914, "didn": 915, "15": 916, "dashboarding": 917, "conversational": 918, "voice": 919, "adtech": 920, "gaming": 921, "healthtech": 922, "junior": 923, "classical": 924, "methods": 925, "like": 926, "insurance": 927, "intelligent": 928, "works": 929, "enough": 930, "debugging": 931, "know": 932, "matter": 933, "noise": 934, "developed": 935, "500k": 936, "documents": 937, "all": 938, "minilm": 939, "l6": 940, "v2": 941, "initially": 942, "later": 943, "upgraded": 944, "bge": 945, "fast": 946, "nearest": 947, "neighbor": 948, "expansion": 949, "module": 950, "handles": 951, "vocabulary": 952, "mismatch": 953, "queries": 954, "terms": 955, "reported": 956, "35": 957, "prior": 958, "validated": 959, "10m": 960, "users": 961, "combined": 962, "uses": 963, "similarity": 964, "cold": 965, "starts": 966, "warm": 967, "went": 968, "200": 969, "launch": 970, "session": 971, "native": 972, "hands": 973, "combining": 974, "dense": 975, "recall": 976, "corpus": 977, "30m": 978, "candidate": 979, "profiles": 980, "spans": 981, "selection": 982, "behavioral": 983, "signal": 984, "ties": 985, "together": 986, "early": 987, "larger": 988, "tradeoffs": 989, "care": 990, "weeks": 991, "theoretically": 992, "perfect": 993, "currently": 994, "move": 995, "intelligence": 996, "electronics": 997, "marketplace": 998, "going": 999, "live": 1000, "tf": 1001, "idf": 1002, "challenge": 1003, "new": 1004, "exploration": 1005, "exploitation": 1006, "policy": 1007, "thompson": 1008, "sampling": 1009, "llama": 1010, "7b": 1011, "mistral": 1012, "specific": 1013, "jd": 1014, "matching": 1015, "curation": 1016, "generated": 1017, "preference": 1018, "pairs": 1019, "recruiter": 1020, "labels": 1021, "harness": 1022, "scores": 1023, "deployed": 1024, "sub": 1025, "200ms": 1026, "p95": 1027, "latency": 1028, "quantizing": 1029, "int8": 1030, "batching": 1031, "request": 1032, "dropped": 1033, "04": 1034, "gpt": 1035, "fallback": 1036, "001": 1037, "lot": 1038, "rigor": 1039, "too": 1040, "many": 1041, "ship": 1042, "without": 1043, "benchmarks": 1044, "trust": 1045, "internet": 1046, "ex": 1047, "top": 1048, "operating": 1049, "single": 1050, "digit": 1051, "millisecond": 1052, "believe": 1053, "solved": 1054, "careful": 1055, "rigorous": 1056, "bigger": 1057, "50m": 1058, "hnsw": 1059, "ranker": 1060, "falling": 1061, "back": 1062, "when": 1063, "budget": 1064, "tight": 1065, "ndcg": 1066, "mrr": 1067, "calibrated": 1068, "surfaced": 1069, "reranking": 1070, "edge": 1071, "cases": 1072, "several": 1073, "connect": 1074, "relevant": 1075, "algorithms": 1076, "middle": 1077, "decide": 1078, "show": 1079, "only": 1080, "rather": 1081, "v1": 1082, "made": 1083, "mistakes": 1084, "optimizing": 1085, "numbers": 1086, "beautiful": 1087, "notice": 1088, "faster": 1089, "processed": 1090, "billions": 1091, "served": 1092, "millions": 1093, "low": 1094, "effort": 1095, "boring": 1096, "essential": 1097, "index": 1098, "refresh": 1099, "understanding": 1100, "calibration": 1101, "legible": 1102, "had": 1103, "understand": 1104, "matches": 1105, "judgment": 1106, "none": 1107, "optional": 1108, "complete": 1109, "overhaul": 1110, "took": 1111, "heuristic": 1112, "grew": 1113, "me": 1114, "engineers": 1115, "course": 1116, "representations": 1117, "natural": 1118, "language": 1119, "along": 1120, "way": 1121, "gotten": 1122, "retraining": 1123, "schedules": 1124, "chatbot": 1125, "integrated": 1126, "ticketing": 1127, "ingestion": 1128, "chunking": 1129, "storing": 1130, "answer": 1131, "smaller": 1132, "control": 1133, "automatic": 1134, "bleu": 1135, "rouge": 1136, "cut": 1137, "average": 1138, "ticket": 1139, "resolution": 1140, "31": 1141, "supported": 1142, "categories": 1143, "operated": 1144, "experiment": 1145, "tracking": 1146, "success": 1147, "prioritize": 1148, "outreach": 1149, "distribution": 1150, "alerting": 1151, "mentored": 1152, "year": 1153, "represented": 1154, "internally": 1155, "results": 1156, "appear": 1157, "each": 1158, "intent": 1159, "spanned": 1160, "methodology": 1161, "direct": 1162, "pm": 1163, "means": 1164, "fair": 1165, "amount": 1166, "correlated": 1167, "turned": 1168, "hardest": 1169, "personalization": 1170, "learns": 1171, "improves": 1172, "environment": 1173, "connected": 1174, "critical": 1175, "adaptation": 1176, "text": 1177, "encoders": 1178, "peak": 1179, "qps": 1180, "8k": 1181, "recommendations": 1182, "sourcing": 1183, "wasn": 1184, "would": 1185, "after": 1186, "iterations": 1187, "we": 1188, "landed": 1189, "simulated": 1190, "held": 1191, "de": 1192, "facto": 1193, "recsys": 1194, "powers": 1195, "rebuilt": 1196, "72": 1197, "91": 1198, "everything": 1199, "before": 1200, "defining": 1201, "metric": 1202, "investing": 1203, "don": 1204, "rollout": 1205, "35m": 1206, "items": 1207, "sparse": 1208, "vectors": 1209, "mpnet": 1210, "reduced": 1211, "improving": 1212, "footprint": 1213, "600gb": 1214, "every": 1215, "min": 1216, "opinions": 1217, "hammer": 1218, "ir": 1219, "usually": 1220, "flagship": 1221, "thing": 1222, "hard": 1223, "rarely": 1224, "fed": 1225, "told": 1226, "us": 1227, "whether": 1228, "healthy": 1229, "indexing": 1230, "successive": 1231, "24": 1232, "shortlist": 1233, "38": 1234, "versioning": 1235, "rollback": 1236, "paths": 1237, "let": 1238, "recruiters": 1239, "embedded": 1240, "libraries": 1241, "heart": 1242, "": 1243}